EXPLAIN ANALYZE
SELECT "Н_ЛЮДИ"."ИД", "Н_ВЕДОМОСТИ"."ИД"
from "Н_ЛЮДИ"
         INNER JOIN "Н_ВЕДОМОСТИ" ON ("Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
WHERE "ИМЯ" = 'Николай'
  AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 42390
  AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" > 53285;

-----------------------------------1-------------------------------------
CREATE INDEX index_ЧЛВК_ИД ON "Н_ВЕДОМОСТИ" USING btree ("ЧЛВК_ИД");

-----------------------------------2-------------------------------------
CREATE INDEX index_ИМЯ ON "Н_ЛЮДИ" USING btree ("ИМЯ")